ThienBui2x/Air-quality-Monitoring-system/AQI_NBIOT_RTX_v3-20220130T132835Z-001/AQI_NBIOT_RTX_v3/STM32L1_AQI.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32L1
PA11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.GPXTI1.0=GPIO_EXTI1
ProjectManager.MainLocation=Src
PH0-OSC_IN.Signal=RCC_OSC_IN
USART2.IPParameters=VirtualMode,BaudRate
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32L152C8Tx
PB10.Mode=Asynchronous
ADC.Rank-0\#ChannelRegularConversion=1
USART1.BaudRate=9600
RCC.PLLCLKFreq_Value=12000000
PA12.GPIOParameters=GPIO_Speed,GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_I2C1_Init-I2C1-false-HAL-true,4-MX_USART1_UART_Init-USART1-false-HAL-true,5-MX_USART2_UART_Init-USART2-false-HAL-true,6-MX_TIM6_Init-TIM6-false-HAL-true,7-MX_USART3_UART_Init-USART3-false-HAL-true
PA11.GPIOParameters=GPIO_Speed,GPIO_Label
RCC.RTCFreq_Value=37000
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USART1.IPParameters=VirtualMode,BaudRate
PB11.Signal=USART3_RX
PA5.PinState=GPIO_PIN_SET
PinOutPanel.RotationAngle=0
PA0-WKUP1.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_HSI
ProjectManager.StackSize=0x400
PC13-WKUP2.GPIO_PuPd=GPIO_PULLUP
Mcu.IP4=SYS
RCC.FCLKCortexFreq_Value=16000000
Mcu.IP5=TIM6
Mcu.IP2=NVIC
Mcu.IP3=RCC
Mcu.IP0=ADC
PA12.Locked=true
Mcu.IP1=I2C1
PA12.Signal=GPIO_Output
USART3.BaudRate=9600
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=16000000
Mcu.IPNb=9
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=16000000
PB6.Signal=I2C1_SCL
PB6.Mode=I2C
PA8.GPIOParameters=GPIO_Speed,GPIO_Label
Mcu.Pin6=PA2
Mcu.Pin7=PA3
Mcu.Pin8=PA4
Mcu.Pin9=PA5
PA1.GPIO_PuPd=GPIO_PULLUP
RCC.AHBFreq_Value=16000000
PH0-OSC_IN.Mode=HSE-External-Oscillator
Mcu.Pin0=PC13-WKUP2
Mcu.Pin1=PC14-OSC32_IN
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PH0-OSC_IN
Mcu.Pin3=PH1-OSC_OUT
Mcu.Pin4=PA0-WKUP1
Mcu.Pin5=PA1
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
PC13-WKUP2.Signal=GPIO_Output
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIO_PuPd=GPIO_PULLUP
PA8.Locked=true
PA4.Locked=true
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PA4.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PC13-WKUP2.GPIOParameters=GPIO_PuPd
ProjectManager.FirmwarePackage=STM32Cube FW_L1 V1.9.0
MxDb.Version=DB.5.0.60
PA1.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=8000000
PA14.Mode=Serial_Wire
PA5.GPIO_PuPd=GPIO_PULLUP
File.Version=6
PB7.Signal=I2C1_SDA
PA8.Signal=GPIO_Output
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TIM6.Period=3999
ProjectManager.HalAssertFull=false
PC14-OSC32_IN.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
ProjectManager.ProjectName=STM32L1_AQI
PC14-OSC32_IN.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PH1-OSC_OUT.Mode=HSE-External-Oscillator
Mcu.Package=LQFP48
PB1.Signal=ADC_IN9
PA5.Locked=true
PC14-OSC32_IN.PinState=GPIO_PIN_SET
USART2.VirtualMode=VM_ASYNC
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=37000
SH.GPXTI0.0=GPIO_EXTI0
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
USART3.IPParameters=VirtualMode,BaudRate
PA10.Signal=USART1_RX
ADC.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_9
PA5.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label
RCC.APB1TimFreq_Value=16000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC14-OSC32_IN.GPIO_Label=Enable
PA4.GPIO_Label=PMS_SET
PA8.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
ProjectManager.CustomerFirmwarePackage=
PC14-OSC32_IN.Locked=true
PA12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
RCC.MSIClockRange=RCC_MSIRANGE_6
PA3.Signal=USART2_RX
RCC.TIMFreq_Value=16000000
RCC.MSI_VALUE=4194000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
ProjectManager.ProjectFileName=STM32L1_AQI.ioc
PA10.Mode=Asynchronous
Mcu.PinsNb=24
ProjectManager.NoMain=false
PA0-WKUP1.Locked=true
TIM6.Prescaler=3
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
SH.GPXTI0.ConfNb=1
PA11.GPIO_Label=S1
ProjectManager.DefaultFWLocation=true
ADC.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag
ProjectManager.DeletePrevious=true
PC14-OSC32_IN.Signal=GPIO_Output
RCC.TimerFreq_Value=16000000
USART2.BaudRate=9600
PA12.GPIO_Label=S2
RCC.FamilyName=M
NVIC.TIM6_IRQn=true\:0\:0\:false\:false\:true\:true\:true
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
PA13.Signal=SYS_JTMS-SWDIO
PA3.Mode=Asynchronous
PA11.Locked=true
PA9.Mode=Asynchronous
PA8.GPIO_Label=S0
TIM6.IPParameters=Prescaler,Period
PA4.PinState=GPIO_PIN_SET
PB11.Mode=Asynchronous
ProjectManager.TargetToolchain=MDK-ARM V5
PA9.Signal=USART1_TX
PA0-WKUP1.Signal=GPXTI0
ADC.NbrOfConversionFlag=1
RCC.LSE_VALUE=32768
PA1.Signal=GPXTI1
PB1.Locked=true
PB10.Signal=USART3_TX
PA5.Signal=GPIO_Output
RCC.MCOPinFreq_Value=16000000
board=custom
RCC.VCOOutputFreq_Value=24000000
ProjectManager.LastFirmware=true
RCC.APB2Freq_Value=16000000
MxCube.Version=5.6.1
PA1.GPIO_Label=NBIOT_WK
VP_SYS_VS_Systick.Mode=SysTick
PH1-OSC_OUT.Signal=RCC_OSC_OUT
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,LSE_VALUE,LSI_VALUE,MCOPinFreq_Value,MSIClockRange,MSI_VALUE,PLLCLKFreq_Value,PLLSourceVirtual,PWRFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TIMFreq_Value,TimerFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L152C(6-8-B)Tx
RCC.RTCHSEDivFreq_Value=4000000
PA2.Signal=USART2_TX
ProjectManager.UnderRoot=false
Mcu.IP8=USART3
Mcu.IP6=USART1
Mcu.IP7=USART2
ProjectManager.CoupleFile=false
RCC.48MHZClocksFreq_Value=12000000
NVIC.EXTI0_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=16000000
Mcu.Pin22=VP_SYS_VS_Systick
Mcu.Pin23=VP_TIM6_VS_ClockSourceINT
PA1.Locked=true
Mcu.Pin20=PB6
PC13-WKUP2.Locked=true
Mcu.Pin21=PB7
PA5.GPIO_Label=PMS_RESET
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
USART3.VirtualMode=VM_ASYNC
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PB7.Mode=I2C
PA11.Signal=GPIO_Output
PA14.Signal=SYS_JTCK-SWCLK
PA0-WKUP1.GPIO_Label=OLED_WK
ProjectManager.HeapSize=0x200
Mcu.Pin15=PA10
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0-WKUP1.GPIO_PuPd=GPIO_PULLDOWN
PB1.Mode=IN9
Mcu.Pin16=PA11
Mcu.Pin13=PA8
Mcu.Pin14=PA9
Mcu.Pin19=PA14
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PA12
RCC.HSI_VALUE=16000000
Mcu.Pin18=PA13
PA5.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PB10
Mcu.Pin12=PB11
Mcu.Pin10=PB1
PA2.Mode=Asynchronous
RCC.PWRFreq_Value=16000000
ADC.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_4CYCLES
SH.GPXTI1.ConfNb=1
RCC.APB1Freq_Value=16000000
ProjectManager.DeviceId=STM32L152C8Tx
ProjectManager.LibraryCopy=2
